入力インターフェース

シリアルバス　データを少しずつ運ぶ。長距離向き

パラレルパス　一度にたくさんのデータ。短距離向き

シリアル(USB,HDMI,IEEE1394,DVI,DISPLAY PORT)

パラレル（PCMCIA,SCSI,IDE)

USB2.0 半二重通信,最大供給電力500mA,データ転送速度　480Mbps

USB3.0全二重通信　最大供給電力900mA,データ転送速度 5Gbps

ワイヤレスインタフェース

Bluutooth 2.4Ghzの電波で通信。最大１００ｍ

IrDA赤外線で通信　ＲＦＩＤ　ＩＤ情報埋め込んだため、近距離でできる

ＮＦＣ機器を近づけるだけで通信できる

Zigbee 低電力で距離短く、転送速度遅い

アドレスパス　メモリ上のあどれす伝送するためのパス(1つの信号線で送れる情報1ビット。１０本の信号線あれば1024ビット）

システムバス　ＰＣ内部の装置を結ぶパス。なのでこれがシステム全体の性能決める

デバイスドライバ　ソフトウェアとハードウェアの通信間制御

プログラム制御　プログラムで主記憶と入出力の通信制御

チャネル制御　入出力のプロセッサ制御

ライトスルー　メモリの関係上もスルーし、主記憶にも書き込む

